{
  //True to enable automatic backups in intervals.  False to disable. [default = true]
  //In single player, only backs up if the game is not paused.
  "enableAutomaticBackups": true,
  //Delay in seconds between automatic backups. [default = 3600] [minimum = 10]
  "backupIntervalInSeconds": 3600,
  //Only backup if players were online for the backup interval. [default = true]
  //You might want to set this to false if the server is loading chunks even when no one is online.
  "onlyBackupIfPlayersOnline": true,
  //True to trigger a backup when server is stopped.  False to disable [default = true]
<<<<<<< HEAD
  //WARNING: this will only reliably trigger and finish if you stop server via a 'stop' command to the server console.
  //	If you exit the server via another termination mechanism such as CTRL+C, the backup may not be complete.
=======
  //Note: this may not properly finish the backup if you try to terminate the process with an interruption
  //	such as CTRL+C!  Double check the backup file is the size you expect
>>>>>>> 99f86d8 (Bump to 1.2.2)
  "enableServerStoppedBackup": true,
  //Backup format.  Supports simply backing up as a direct copy of the folder, or ZIP [default = "ZIP"]
  //Supported formats: "DIRECTORY", "ZIP"
  "backupFormat": "ZIP",
  //Percentage of disk space available required before creating a backup.  [default = 20]
  //This will prevent generating backups if your disk space is getting close to maxing out.
  "percentageAvailableDiskSpaceRequirement": 20,
  //Maximum number of backups to keep at a given time.  [default = 10]
  //If we generate a backup, but have more backups than this number, the oldest backup will be deleted.
  "maxBackupsToKeep": 10,
  //True to enable manual backups, false to disable  [default = true]
  "enableManualBackups": true,
  //Permission level to allow manual backups.  [4 = Ops] [0 = everyone] [default = 4]
  "permissionLevelForManualBackups": 4,
  //Broadcast messages when server is backing up and success/failed.  These are in the config file to allow
  //servers to use whatever language they want without updating the mod source directly.  Default language is english
  "broadcastMessages": {
    "simplebackup.backup.success.broadcast": "Server was successfully backed up to ",
    "simplebackup.backup.failed.broadcast1": "Server failed to backup to ",
    "simplebackup.backup.failed.broadcast2": ".  Please check the server logs for errors!",
    "simplebackup.backup.broadcast": "Starting server backup...",
    "simplebackup.manualbackup.disabled": "Manual backups are disabled by the server!",
    "simplebackup.manualbackup.started": " triggered a manual backup",
    "simplebackup.manualbackup.alreadyexists": "There is already an ongoing manual backup.  Please wait for it to finish before starting another!",
    "simplebackup.manualbackup.notallowed": "You don\u0027t have permissions to trigger a manual backup!  Sorry :("
  }
}
